#
# Homebrew apps
#
# usage:
#   $ brew bundle
#
#

# Web Browser
cask "google-chrome"
cask "firefox"

# Mailer
cask "thunderbird"

# IME
cask "google-japanese-ime"

# Editor
cask "visual-studio-code"
cask "macdown"
cask "drawio"
brew "plantuml"
cask "figma"
cask "mysqlworkbench"

# Cloud Storage
cask "google-drive"
cask "dropbox"

# Office
cask "microsoft-office"
cask "microsoft-teams"
cask "zoom"

# Game
cask "steam"
cask "unity-hub"

# Video
cask "vlc"
brew "ffmpeg"
# brew "youtube-dl"
brew "yt-dlp"
cask "vrew"

# Image
cask "imageoptim"
brew "imagemagick"

# Audio
cask "audacity"

# Archive
cask "keka"

# VCS
brew "git"
brew "git-secrets"
brew "gh"
brew "gpg"
brew "pinentry-mac"
brew "svn"
cask "sourcetree"

# Server/VM/Container
cask "docker"
brew "ansible"
brew "awscli"
# UnAvailable
#   cask "docker-machine"
# Only Intel Mac
#   cask "virtualbox"
# Error
#   cask "parallels"
#   cask "parallels-toolbox"


# Programing Laungage
brew "php"
brew "composer"
brew "nodebrew"
brew "go"

# Network
cask "vpn-by-google-one"
cask "tunnelblick"
cask "postman"
cask "proxyman"
cask "cyberduck"

# Scan
cask "fujitsu-scansnap-home"

# Books/KDP
cask "kindle-previewer"
brew "pandoc"
brew "pandoc-crossref"

# Util
cask "alfred"
cask "flux"
cask "amorphousdiskmark"
brew "f3"

#--------------------------------------------------------
# CLI
#--------------------------------------------------------
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"

brew "htop"
brew "colordiff"
brew "nkf"
brew "wget"
brew "tree"
brew "telnet"
brew "jq"
brew "python-yq"
brew "sl"


#--------------------------------------------------------
# MAS
#--------------------------------------------------------
mas "Final Cut Pro", id: 424389933
mas "Xcode", id: 497799835
mas "CotEditor", id: 1024640650
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "MindNode", id: 1289197285
mas "デスクトップ時計", id: 894760156
mas "Skitch", id: 425955336
mas "Pixelmator Classic", id: 407963104
mas "Kindle", id: 302584613

